package Lab5;

/*
    Підготувати ігрову кімнату для дітей різних вікових груп.
    Іграшок повинно бути фіксована кількість у межах виділеної суми грошей.
    Повинні зустрічатися іграшки для різних вікових груп: маленькі, середні та великі машинки, ляльки, м'ячі, кубики.
    Провести сортування іграшок у кімнаті за будь-яким параметром.
    Знайти іграшку в кімнаті, що відповідає заданому діапазону вартості.
    */

public class Lab5Main {

    public static void main(String[] args) {
        GameRoom gm = new GameRoom(20);
        gm.sortBySize();
        gm.sortByColor();
        gm.sortByPrize();
        gm.sortByAge();
        gm.find(4.2f, 8.6f);

    }
}
